Tekla Open API Reference for Tekla Structures 2025
BasePoint.GetCoordinateSystem Method
 Gets the coordinate system of the base point.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CoordinateSystem GetCoordinateSystem(
	BasePoint.CoordinateSystemType CoordsysType = BasePoint.CoordinateSystemType.GLOBAL
)
Public Function GetCoordinateSystem (
	Optional CoordsysType As BasePoint.CoordinateSystemType = BasePoint.CoordinateSystemType.GLOBAL
) As CoordinateSystem
Parameters
CoordsysType (Optional)
Type: Tekla.Structures.Model.BasePoint.CoordinateSystemType
Optional: Type of the coordinate system.
Return Value
Type: CoordinateSystem
The coordinate system of the base point.
See Also
Reference
BasePoint Class
Tekla.Structures.Model Namespace